主线程        |    客户线程           |    投标线程         |    出价线程          |    通信/处理函数
                                                                                                      
                                                                 
              |--- ppthread_trigger --|---------------------|----------------------|--- proc_trigger(处理触发信号的相关事宜)                                                 
              |  [程序初始化后启动]                                                
              |  [子线程销毁后销毁]                                                
              |  [只有一个线程]                                                                                                
              |                                             |----------------------|--- proc_login(SSL登录)                                         
              |                                             |                                         
              |                                             |                                         
              |                                             |----------------------|--- proc_login_udp(UDP登录)                                         
              |                                             |                                         
              |                                             |                                         
              |                       |--- ppthread_login --|----------------------|--- proc_status_udp(监控UDP里的状态变化)                                                              
              |                       |[client线程启动后启动]                                                              
              |                       | [投标完成后销毁]                                                              
              |                       |                                                             
pp_control ---|--- ppthread_client ---|--- ppthread_bid0 ---|----------------------|--- proc_image(立即执行)
                [程序初始化后启动]    | [上半场开始后启动]                         |                  
                [子线程销毁后销毁]    | [投标完成后销毁]                           |                  
                [每个投标号一个线程]  |                                            |--- proc_image_decode(短连接,阻塞等待返回)                  
                                      |                                            |                
                                      |                                            |               
                                      |                                            |--- proc_price(立即执行)
                                      |                                                             
                                      |                                                             
                                      |--- ppthread_bid1 ---|--- ppthread_image ---|--- proc_image(先预热连接，等事件信号执行)                                                             
                                      | [下半场开始后启动]  | [下半场结束后销毁]   |                   
                                      | [下半场结束后销毁]  |                      |                                        
                                      |                     |                      |--- proc_image_decode(短连接,阻塞等待返回)                                        
                                      |                     |                                                               
                                      |                     |                                                               
                                      |                     |--- ppthread_price ---|--- proc_price(先预热连接，等事件信号执行)                                        
                                      |                       [下半场结束后销毁]                            
                                      |                                                             
                                      |--- ppthread_bid2 ---|--- ppthread_image ---|--- proc_image(先预热连接，等事件信号执行)                                                             
                                        [下半场开始后启动]  | [下半场结束后销毁]   |                   
                                        [下半场结束后销毁]  |                      |                                        
                                                            |                      |--- proc_image_decode(短连接,阻塞等待返回)                                        
                                                            |                                                               
                                                            |                                                               
                                                            |--- ppthread_price ---|--- proc_price(先预热连接，等事件信号执行)                                        
                                                              [下半场结束后销毁]                            
                                                               
                                                               
                                      |---------------------|                         
                                      | bid1和bid2两个线程  |
                                      | 采用不同的投标策略  |                                                           
                                      | bid1由时间触发      |
                                      | bid2由价格触发      |
                                      |---------------------|                         
